#Использовать cli
#Использовать "."

///////////////////////////////////////////////////////////////////////////////

Процедура ВыполнитьПриложение()
	
	КонсольноеПриложение = Новый КонсольноеПриложение(ПараметрыПриложения.ИмяПриложения(), "OneScript Version Manager");
	КонсольноеПриложение.Версия("v version", ПараметрыПриложения.Версия());
	
	КомандаПриложения = КонсольноеПриложение.ДобавитьКоманду("i install", "Установка OneScript указанной версии", Новый КомандаInstall());
	КомандаПриложения.Аргумент("VERSION", , "Устанавливаемая версия OneScript").ТСтрока();

	// КонсольноеПриложение.УстановитьОсновноеДействие(ЭтотОбъект);
	КонсольноеПриложение.Запустить(АргументыКоманднойСтроки);
	
КонецПроцедуры

Попытка
	ВыполнитьПриложение();
Исключение
	Сообщить(ОписаниеОшибки());
КонецПопытки;
